Revit 2021.1 API
RevisionSettings.GetAlphanumericRevisionSettings Method
 Returns a copy of the AlphanumericRevisionSettings owned by this RevisionSettings object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
Since: 2016
Syntax
C#
public AlphanumericRevisionSettings GetAlphanumericRevisionSettings()
Visual Basic
Public Function GetAlphanumericRevisionSettings As AlphanumericRevisionSettings
Visual C++
public:
AlphanumericRevisionSettings^ GetAlphanumericRevisionSettings()
Return Value
 The copy of the AlphaumericRevisionSettings owned by this RevisionSettings object.
See Also
RevisionSettings Class
Autodesk.Revit.DB Namespace